Configuration/InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РезультатыСпециальнойОценкиУсловийТруда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/КлассыУсловийТрудаПоДолжностям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КлассыУсловийТрудаПоДолжностям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезультатыСпецоценкиУсловийТруда</v8:Type>
						<v8:Type>cfg:DocumentRef.УтверждениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеШтатногоРасписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УсловияТруда</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Регистраторы = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ЭтотОбъект, Замещение, "Регистратор");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредыдущийНабор.Должность КАК Должность,
	|	ПредыдущийНабор.Период КАК Период,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРегистрацииИзменений,
	|	NULL КАК КлассУсловийТруда,
	|	NULL КАК Основание,
	|	ИСТИНА КАК УдалитьЗапись
	|ИЗ
	|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК ПредыдущийНабор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда КАК ТекущийНабор
	|		ПО ПредыдущийНабор.Должность = ТекущийНабор.РабочееМесто
	|			И ПредыдущийНабор.Период = ТекущийНабор.Период
	|			И ПредыдущийНабор.Основание = ТекущийНабор.Регистратор
	|ГДЕ
	|	ПредыдущийНабор.Основание В (&Регистраторы)
	|	И ТекущийНабор.РабочееМесто ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТекущийНабор.РабочееМесто,
	|	ТекущийНабор.Период,
	|	НАЧАЛОПЕРИОДА(ТекущийНабор.Период, МЕСЯЦ),
	|	ТекущийНабор.КлассУсловийТруда,
	|	ТекущийНабор.Регистратор,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда КАК ТекущийНабор
	|ГДЕ
	|	ТекущийНабор.Регистратор В (&Регистраторы)
	|	И ТекущийНабор.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)"; 
	
	НачатьТранзакцию();
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КлассыУсловийТрудаПоДолжностям");
			ЭлементБлокировки.УстановитьЗначение("Должность", Выборка.Должность);
			ЭлементБлокировки.УстановитьЗначение("Период", Выборка.Период);
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.КлассыУсловийТрудаПоДолжностям.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Должность.Установить(Выборка.Должность);
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			
			Если Выборка.УдалитьЗапись Тогда
				НаборЗаписей.Записать();
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.КлассУсловийТруда) Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
